// ////////////////////////////////////////////////////////
//
// J_Swap.java
//
// 开发者: 雍俊海
// ////////////////////////////////////////////////////////
// 简介:
//     采用按位异或运算实现交换两个整数的例程。
// ////////////////////////////////////////////////////////
//     雍俊海. Java程序设计教程(第3版). 北京: 清华大学出版社. 2014.

public class J_Swap {
    public static void main(String args[]) {
        int a = 123;
        int b = 321;
        System.out.println("a=" + a + ", b=" + b);
        a = a ^ b;
        b = a ^ b;
        a = a ^ b;
        System.out.println("a=" + a + ", b=" + b);
    } // 方法main结束
} // 类J_Swap结束


//J_Break.java